README.org
#+TITLE: Gb's Emacs Config UwU
#+DESCRIPTION: Gabriel's Emacs configuration with evil keys.
#+AUTHOR: Gabriel G. de Brito
#+STARTUP: overview

My configurations for the One True Editor®! Of course, they use the
evil keys!

/There is no system but GNU, and Linux is one of it's kernels./
- Saint IGNUcius (Richard M. Stallman)

Alongside this document, the ~init.el~ file contains the code necessary
to load the configuration from the Org document and some stuff added
via the GUI by ~custom~.

** License

I apologize Mr. Stallman for this, but this code is licensed under the
following terms (MIT License):

#+begin_example
Copyright (C) 2023  Gabriel G. de Brito

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:
The above copyright notice and this permission notice shall be included in
all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
THE SOFTWARE.
#+end_example

** Early Settings

Setup ~use-package~ and the Melpa repository of software.

#+begin_src emacs-lisp
  (require 'package)
  (add-to-list 'package-archives
    '("melpa" . "https://melpa.org/packages/"))
  (package-initialize)
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))
  (setq use-package-always-ensure t)
#+end_src

Setup Evil Mode early, so we can use some functions later.

#+begin_src emacs-lisp
  (use-package evil
    :ensure t
    :init
    (setq evil-want-C-u-scroll t)
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (evil-mode))
#+end_src

** General Settings

+ Turns all =yes/no= prompts into =y/n= for the sake of "I'm too lazy to type an entire 'yes' or 'no'";
+ Sets my name and email.
+ Sets the fortune file.

#+begin_src emacs-lisp
  (fset 'yes-or-no-p 'y-or-n-p)
  (setq make-backup-files nil)
  (setq user-full-name "Gabriel G. de Brito")
  (setq user-mail-address "gabrielgbrito@icloud.com")
  (setq fortune-file "/home/gb/.config/emacs/fortune")
#+end_src

*** Prompt to quit

This code copies the prompt with random sentences from
[[https://github.com/doomemacs/doomemacs][Doom Emacs]] to quit. Also,
replaces the ~evil-quit~ command from [[https://github.com/emacs-evil/evil][Evil Mode]] to use it if the
user tries to kill both Emacs itself and a client. Both
functionalities were effectively ported from the projects.

#+begin_src emacs-lisp
(defvar +doom-quit-messages
  '(;; from Doom 1
    "Please don't leave, there's more demons to toast!"
    "Let's beat it -- This is turning into a bloodbath!"
    "I wouldn't leave if I were you. DOS is much worse."
    "Don't leave yet -- There's a demon around that corner!"
    "Ya know, next time you come in here I'm gonna toast ya."
    "Go ahead and leave. See if I care."
    "Are you sure you want to quit this great editor?"
    ;; from Portal
    "Thank you for participating in this Aperture Science computer-aided enrichment activity."
    "You can't fire me, I quit!"
    "I don't know what you think you are doing, but I don't like it. I want you to stop."
    "This isn't brave. It's murder. What did I ever do to you?"
    "I'm the man who's going to burn your house down! With the lemons!"
    "Okay, look. We've both said a lot of things you're going to regret..."
    ;; Custom
    "(setq nothing t everything 'permitted)"
    "Emacs will remember that."
    "Emacs, Emacs never changes."
    "Hey! Hey, M-x listen!"
    "It's not like I'll miss you or anything, b-baka!"
    "Wake up, Mr. Stallman. Wake up and smell the ashes."
    "You are *not* prepared!"
    "Please don't go. The drones need you. They look up to you.")
  "A list of quit messages, picked randomly by `+doom-quit'. Taken from
http://doom.wikia.com/wiki/Quit_messages and elsewhere.")
(defun +doom-quit-fn (&rest _)
  (y-or-n-p
   (format "%s %s"
           (propertize (nth (random (length +doom-quit-messages))
                            +doom-quit-messages)
                       'face '(italic default))
           "Really quit Emacs?")))

;; basically plain evil-quit but with a confirmation if quitting client or emacs
;; so partially stolen from https://github.com/emacs-evil/evil
(evil-define-command evil-quit (&optional force)
  :repeat nil
  (interactive "<!>")
  (condition-case nil
      (delete-window)
    (error
     (if (and (boundp 'server-buffer-clients)
              (fboundp 'server-edit)
              (fboundp 'server-buffer-done)
              server-buffer-clients)
         (if force
             (server-buffer-done (current-buffer))
           (server-edit))
       (if (+doom-quit-fn) (condition-case nil
           (delete-frame)
         (error
          (condition-case nil
              (tab-bar-close-tab)
            (error
             (if force
                 (kill-emacs)
               (save-buffers-kill-emacs)))))))))))
#+end_src

** Apperance Settings
*** Theme

~doom-dracula~ from Doom Emacs.

#+begin_src emacs-lisp
  (use-package doom-themes
    :ensure t
    :config
    (setq doom-themes-enable-bold t
          doom-themes-enable-italic t)
    (load-theme 'doom-dracula t)
    (doom-themes-org-config))
#+end_src

*** Fonts, Icons and Unicode Support

[[https://github.com/microsoft/cascadia-code][Cascadia Code]], from
Microsoft, but patched by [[https://www.nerdfonts.com/#home][Nerd
Fonts]], so *CaskaydiaCove Nerd Font*. The ~add-to-list~ call is needed so
the fonts looks ok in the Emacs client.

#+begin_src emacs-lisp
  (set-face-attribute 'default nil
    :font "CaskaydiaCove Nerd Font Mono-18"
    :weight 'normal)
  (set-face-attribute 'variable-pitch nil
    :font "CaskaydiaCove Nerd Font-18"
    :weight 'normal)
  (set-face-attribute 'fixed-pitch nil
    :font "CaskaydiaCove Nerd Font Mono-18"
    :weight 'normal)
  (add-to-list 'default-frame-alist '(font . "CaskaydiaCove Nerd Font Mono-18"))
  (use-package all-the-icons
    :ensure t)
#+end_src

Add ~unicode-fonts~ package to get full Unicode support for free 🙂:

#+begin_src emacs-lisp
  (use-package unicode-fonts
    :ensure t
    :config
    (unicode-fonts-setup))
#+end_src

CaskaydiaCove has ligatures, so we're going to support them!

#+begin_src emacs-lisp
  (use-package ligature
    :ensure t
    :load-path "path-to-ligature-repo"
    :config
    (ligature-set-ligatures 't '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                                         ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                                         "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                                         "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                                         "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                                         "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                                         "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                                         "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                                         ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                                         "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                                         "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                                         "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                                         "\\\\" "://" "www"))
    (global-ligature-mode t))
#+end_src

