README.org
*** UI Settings

Disable all the fancy and ugly GUI stuff (why the heck all this stuff is default?).

#+begin_src emacs-lisp
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (blink-cursor-mode 0)
#+end_src

Add line numbers for some modes and configure them to have always a
width of 3, so the text do not jump when scrolling through the
file. Also, adds ~hl-line~ for the package list.

#+begin_src emacs-lisp
  (setq-default display-line-numbers-width 3)
  (setq display-line-numbers-type 'relative)
  (add-hook 'prog-mode-hook 'display-line-numbers-mode)
  (add-hook 'markdown-mode-hook 'display-line-numbers-mode)
  (add-hook 'yaml-mode-hook 'display-line-numbers-mode)
  (add-hook 'org-mode-hook 'display-line-numbers-mode)
  (add-hook 'package-menu-mode-hook 'hl-line-mode)
#+end_src

Sane defauls to scrolling and turn off line wrapping.

#+begin_src emacs-lisp
  (setq scroll-conservatively 1000)
  (setq maximum-scroll-margin 0.5)
  (setq scroll-margin 10)
  (setq-default truncate-lines -1)
  (setq truncate-partial-width-windows nil)
#+end_src

Prettify symbols (change the word "lambda" by a λ and etc) when
editing Emacs Lisp and LaTeX.

#+begin_src emacs-lisp
  (add-hook 'emacs-lisp-mode-hook (lambda () (interactive) (prettify-symbols-mode t)))
  (add-hook 'LaTeX-mode-hook (lambda () (interactive) (prettify-symbols-mode t)))
#+end_src

Add an (almost) default modeline from Doom Emacs.

#+begin_src emacs-lisp
  (setq doom-modeline-buffer-encoding nil)
  (display-time-mode t)
  (display-battery-mode t)
  (use-package doom-modeline
    :ensure t
    :config
    (doom-modeline-mode 1))
#+end_src

Add a cute dashboard without any actual items, just /kawaiiness/.

#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t
    :after all-the-icons
    :config
    (setq dashboard-center-content t)
    (setq dashboard-force-refresh t)
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-banner-logo-title "Gb's Kawaii Lisp Operating System")
    (setq dashboard-startup-banner '"~/.config/emacs/dash.jpg")
    (setq dashboard-items '())
    (setq dashboard-footer-icon (all-the-icons-fileicon "emacs"
                                                       :face 'font-lock-keyword-face))
    (add-hook 'server-after-make-frame-hook 'dashboard-refresh-buffer)
    (dashboard-setup-startup-hook))
#+end_src

Add highlighting to *TODO* entries in code because I never know what *TODO*.

#+begin_src emacs-lisp
  (use-package hl-todo
    :ensure t
    :config
    (global-hl-todo-mode 1))
#+end_src

Finally, add a sane /Zen Mode/.

#+begin_src emacs-lisp
  (use-package darkroom
    :ensure t)
#+end_src

** Tooling

Use a better mode for reading PDFs.

#+begin_src emacs-lisp
  (use-package pdf-tools
    :ensure t
    :config
    (add-to-list 'auto-mode-alist '("\\.pdf\\'" . pdf-view-mode)))
#+end_src

Add a quick way to insert licenses.

#+begin_src emacs-lisp
  (use-package lice
    :ensure t
    :config
    (setq lice:default-license "mit"))
#+end_src

Great project management (with Ivy integration).

#+begin_src emacs-lisp
  (setq projectile-project-search-path '("~/src/"))
  (setq projectile-find-dir-includes-top-level t)
  (setq projectile-switch-project-action 'counsel-find-file)
  (use-package projectile
    :ensure t
    :config
    (projectile-mode +1))
  (use-package counsel-projectile
    :ensure t
    :after counsel)
#+end_src

ILoveTheWeb.

#+begin_src emacs-lisp
  (use-package htmlize
    :ensure t)
#+end_src

** Completion, Fuzzy Finding and Friends

Just use Ivy with icons!

#+begin_src emacs-lisp
  (use-package smex
    :ensure t)
  (use-package counsel
    :ensure t)
  (use-package flx
    :ensure t)
  (use-package ivy
    :ensure t
    :config
    (setq ivy-initial-inputs-alist nil)
    :init
    (ivy-mode t)
    (setq ivy-re-builders-alist
      '((t . ivy--regex-fuzzy))))
  (use-package all-the-icons-ivy
    :ensure t
    :after all-the-icons
    :config
    (all-the-icons-ivy-setup))
#+end_src

Also, the best ~grep~ ever:
[[https://github.com/BurntSushi/ripgrep][ripgrep]]!

#+begin_src emacs-lisp
(use-package rg
  :ensure t)
#+end_src

** Femboy Programmer Stuff

Sets an empty default compiler command and enable code folding.

#+begin_src emacs-lisp
  (setq compile-command "")
  (add-hook 'prog-mode-hook 'hs-minor-mode)
#+end_src

Enables [[https://editorconfig.org/][editorconfig]], even knowing that
nobody actually uses it.

#+begin_src emacs-lisp
  (use-package editorconfig
    :config
    (editorconfig-mode 1))
#+end_src

*** Languages Configuration!

Markdown (like Org Mode but for weebs).

#+begin_src emacs-lisp
  (use-package markdown-mode
    :ensure t
    :config
    (setq markdown-fontify-code-blocks-natively t
          markdown-open-command "markdown"
          markdown-asymmetric-header t
          markdown-header-scaling t
          markdown-hide-urls t))
#+end_src

Haskell λ (like Lisp but without parenthesis).

#+begin_src emacs-lisp
  (use-package haskell-mode
    :ensure t)
#+end_src

Julia <3 (like Python but simpler and with a built-in ~numpy~).

#+begin_src emacs-lisp
  (use-package julia-mode
    :ensure t)
#+end_src

Lua UwU <3 <3 💙 (My favorite language!!)

#+begin_src emacs-lisp
  (use-package lua-mode
    :ensure t)
#+end_src

Rust (btw).

#+begin_src emacs-lisp
  (use-package rust-mode
    :ensure t
    :config
    (setq rust-format-on-save t))
#+end_src

yaml (yes, another configuration language... oops, markup).

#+begin_src emacs-lisp
  (use-package yaml-mode
    :ensure t)
#+end_src

C (like Rust but for dinossaurs).

#+begin_src emacs-lisp
  (setq c-default-style "k&r"
        c-basic-offset 4)
#+end_src

rasi (literally CSS but with another extension)

#+begin_src emacs-lisp
  (add-to-list 'auto-mode-alist '("\\.rasi\\'" . css-mode))
#+end_src

Common Lisp (like Lisp but more Lisp than Lisp)

#+begin_src emacs-lisp
  (add-hook 'lisp-mode-hook 'electric-pair-local-mode t)
  (add-hook 'emacs-lisp-mode-hook 'electric-pair-local-mode t)
#+end_src

** Applications
*** Magit

Stupid content tracking (git). The actual only reason I switched from Vim.

#+begin_src emacs-lisp
  (use-package magit
    :ensure t
    :config
    (add-hook 'git-commit-post-finish-hook 'magit))
#+end_src

*** dired

I used the [[https://github.com/gokcehan/lf][Lf]] file manager a lot and like the "ranger-like" way of
file managing. Here, I prefer to use only a panel (with ~deer~), but
still use the fancy ranger selection and stuff. Also, enable icons and
colors.

#+begin_src emacs-lisp
  (setq dired-listing-switches "-lAhf")
  (setq ranger-cleanup-on-disable t)
  (setq ranger-cleanup-eagerly t)
  ;; (setq ranger-show-hidden nil)
  (setq ranger-modify-header nil)
  (setq ranger-preview-file t)
  (setq ranger-show-literal nil)
  (setq ranger-excluded-extensions '("mkv" "iso" "mp4"))
  (setq ranger-override-dired t)
  (setq ranger-width-preview 0.55)
  (setq ranger-max-preview-size 400)
  (setq ranger-hide-cursor nil)
  (use-package ranger
    :ensure t
    :config
    (ranger-override-dired-mode t))
  (use-package diredfl
    :ensure t
    :config
    (add-hook 'dired-mode-hook 'diredfl-mode))
  (use-package all-the-icons-dired
    :ensure t
    :after all-the-icons
    :config
    (add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
    (setq all-the-icons-scale-factor 0.8))
#+end_src

*** Terminal integration

Let's be honest. Terminal emulation inside Emacs is still shit and I
never got vterm working. Only point (except for modal-editing, of
course) that Vim does better for our purposes. So, instead of using a
terminal inside Emacs, I prefer to just use
[[https://alacritty.org/][Alacritty]]

#+begin_src emacs-lisp
  (setq terminal-here-linux-terminal-command 'alacritty)
  (use-package terminal-here
    :ensure t)
#+end_src

*** Completely usefull things

#+begin_src emacs-lisp
  ;; to Rin Shima camp with me 💖
  (use-package fireplace
    :ensure t)

  ;; 🌈🐈
  (use-package zone-nyan
    :ensure t)
  
  ;; quite ironic
  (use-package xkcd
    :ensure t)
#+end_src

*** Org Mode

The actual only reason I stayed in Emacs.

+ Use superstar and hide emphasis markers because I like these gay things;
+ Autosave buffers when quitting agenda;
+ Notifications for agenda items with ~org-alert~;
+ Workaround to unable babel from trying to edit blocks in dedicated buffer.

#+begin_src emacs-lisp
 (use-package org-alert
   :ensure t
   :config
   (setq alert-default-style 'libnotify)
   (setq org-alert-interval 120
 	org-alert-notify-cutoff 10
 	org-alert-notify-after-event-cutoff 10)
   (setq org-alert-notification-title "Org Mode Alert")
   (org-alert-enable))
 (use-package org-superstar
   :ensure t
   :config
   (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1))))
 
 (advice-add 'org-agenda-quit :before 'org-save-all-org-buffers)
 (setq org-directory "~/doc/org")
 (setq org-agenda-files "~/doc/org/agenda-files")
 (setq org-hide-emphasis-markers t)
 (setq org-src-preserve-indentation nil
       org-edit-src-content-indentation 0)
 
 (defun org-edit-src-code nil)
#+end_src

** Keybinds and Editing Model
*** Evil Mode Setup

We already have Evil Mode setup, so now we add usefull things like ~commentary~
and numbers:

#+begin_src emacs-lisp
  (use-package evil-collection
    :ensure t
    :after evil
    :config
    (evil-collection-init))
  (use-package evil-commentary
    :ensure t
    :after evil
    :config
    (evil-commentary-mode))
  (use-package evil-numbers
    :ensure t
    :after evil
    :config
    (define-key evil-normal-state-map (kbd "C-a") 'evil-numbers/inc-at-pt)
    (define-key evil-normal-state-map (kbd "C-x") 'evil-numbers/dec-at-pt))
  (use-package evil-visualstar
    :ensure t
    :config
      (global-visualstar-mode))
#+end_src

