README.el
(scroll-bar-mode -1)
(blink-cursor-mode 0)

(setq-default display-line-numbers-width 3)
(setq display-line-numbers-type 'relative)
(add-hook 'prog-mode-hook 'display-line-numbers-mode)
(add-hook 'markdown-mode-hook 'display-line-numbers-mode)
(add-hook 'yaml-mode-hook 'display-line-numbers-mode)
(add-hook 'org-mode-hook 'display-line-numbers-mode)
(add-hook 'package-menu-mode-hook 'hl-line-mode)

(setq scroll-conservatively 1000)
(setq maximum-scroll-margin 0.5)
(setq scroll-margin 10)
(setq-default truncate-lines -1)
(setq truncate-partial-width-windows nil)

(add-hook 'emacs-lisp-mode-hook (lambda () (interactive) (prettify-symbols-mode t)))
(add-hook 'LaTeX-mode-hook (lambda () (interactive) (prettify-symbols-mode t)))

(setq doom-modeline-buffer-encoding nil)
(display-time-mode t)
(display-battery-mode t)
(use-package doom-modeline
  :ensure t
  :config
  (doom-modeline-mode 1))

(use-package dashboard
  :ensure t
  :after all-the-icons
  :config
  (setq dashboard-center-content t)
  (setq dashboard-force-refresh t)
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-banner-logo-title "Gb's Kawaii Lisp Operating System")
  (setq dashboard-startup-banner '"~/.config/emacs/dash.jpg")
  (setq dashboard-items '())
  (setq dashboard-footer-icon (all-the-icons-fileicon "emacs"
                                                     :face 'font-lock-keyword-face))
  (add-hook 'server-after-make-frame-hook 'dashboard-refresh-buffer)
  (dashboard-setup-startup-hook))

(use-package hl-todo
  :ensure t
  :config
  (global-hl-todo-mode 1))

(use-package darkroom
  :ensure t)

(use-package pdf-tools
  :ensure t
  :config
  (add-to-list 'auto-mode-alist '("\\.pdf\\'" . pdf-view-mode)))

(use-package lice
  :ensure t
  :config
  (setq lice:default-license "mit"))

(setq projectile-project-search-path '("~/src/"))
(setq projectile-find-dir-includes-top-level t)
(setq projectile-switch-project-action 'counsel-find-file)
(use-package projectile
  :ensure t
  :config
  (projectile-mode +1))
(use-package counsel-projectile
  :ensure t
  :after counsel)

(use-package htmlize
  :ensure t)

(use-package smex
  :ensure t)
(use-package counsel
  :ensure t)
(use-package flx
  :ensure t)
(use-package ivy
  :ensure t
  :config
  (setq ivy-initial-inputs-alist nil)
  :init
  (ivy-mode t)
  (setq ivy-re-builders-alist
    '((t . ivy--regex-fuzzy))))
(use-package all-the-icons-ivy
  :ensure t
  :after all-the-icons
  :config
  (all-the-icons-ivy-setup))

(use-package rg
  :ensure t)

(setq compile-command "")
(add-hook 'prog-mode-hook 'hs-minor-mode)

(use-package editorconfig
  :config
  (editorconfig-mode 1))

(use-package markdown-mode
  :ensure t
  :config
  (setq markdown-fontify-code-blocks-natively t
        markdown-open-command "markdown"
        markdown-asymmetric-header t
        markdown-header-scaling t
        markdown-hide-urls t))

(use-package haskell-mode
  :ensure t)

(use-package julia-mode
  :ensure t)

(use-package lua-mode
  :ensure t)

(use-package rust-mode
  :ensure t
  :config
  (setq rust-format-on-save t))

(use-package yaml-mode
  :ensure t)

(setq c-default-style "k&r"
      c-basic-offset 4)

(add-to-list 'auto-mode-alist '("\\.rasi\\'" . css-mode))

(add-hook 'lisp-mode-hook 'electric-pair-local-mode t)
(add-hook 'emacs-lisp-mode-hook 'electric-pair-local-mode t)

(use-package magit
  :ensure t
  :config
  (add-hook 'git-commit-post-finish-hook 'magit)
  (add-hook 'magit-mode-hook 'turn-off-evil-mode))

(setq dired-listing-switches "-lAhf")
(setq ranger-cleanup-on-disable t)
(setq ranger-cleanup-eagerly t)
;; (setq ranger-show-hidden nil)
(setq ranger-modify-header nil)
(setq ranger-preview-file t)
(setq ranger-show-literal nil)
(setq ranger-excluded-extensions '("mkv" "iso" "mp4"))
(setq ranger-override-dired t)
(setq ranger-width-preview 0.55)
(setq ranger-max-preview-size 400)
(setq ranger-hide-cursor nil)
(use-package ranger
  :ensure t
  :config
  (ranger-override-dired-mode t))
(use-package diredfl
  :ensure t
  :config
  (add-hook 'dired-mode-hook 'diredfl-mode))
(use-package all-the-icons-dired
  :ensure t
  :after all-the-icons
  :config
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
  (setq all-the-icons-scale-factor 0.8))

(setq terminal-here-linux-terminal-command 'alacritty)
(use-package terminal-here
  :ensure t)

;; to Rin Shima camp with me 💖
(use-package fireplace
  :ensure t)

;; 🌈🐈
(use-package zone-nyan
  :ensure t)

;; quite ironic
(use-package xkcd
  :ensure t)

(use-package org-alert
  :ensure t
  :config
  (setq alert-default-style 'libnotify)
  (setq org-alert-interval 120
       org-alert-notify-cutoff 10
       org-alert-notify-after-event-cutoff 10)
  (setq org-alert-notification-title "Org Mode Alert")
  (org-alert-enable))
(use-package org-superstar
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1))))

(advice-add 'org-agenda-quit :before 'org-save-all-org-buffers)
(setq org-directory "~/doc/org")
(setq org-agenda-files "~/doc/org/agenda-files")
(setq org-hide-emphasis-markers t)
(setq org-src-preserve-indentation nil
      org-edit-src-content-indentation 0)

(defun org-edit-src-code nil)

(use-package evil-collection
  :ensure t
  :after evil
  :config
  (evil-collection-init))
(use-package evil-commentary
  :ensure t
  :after evil
  :config
  (evil-commentary-mode))
(use-package evil-numbers
  :ensure t
  :after evil
  :config
  (define-key evil-normal-state-map (kbd "C-a") 'evil-numbers/inc-at-pt)
  (define-key evil-normal-state-map (kbd "C-x") 'evil-numbers/dec-at-pt))
(use-package evil-visualstar
  :ensure t
  :config
    (global-visualstar-mode))
