README.org
*** Some Functions

Functions to switch buffers with hate.

#+begin_src emacs-lisp
  (setq hated-buffers '("\*dashboard\*"
                        "\*scratch\*"
                        "\*compilation\*"
                        "\*Help\*"
                        "\*Messages\*"
                        "\*Warnings\*"
                        "agenda.org"
                        "todo.org"
                        "marker.org"
                        "magit:*"))

  (defun check-if-match-regexes (string regex-list)
    (if (null (car regex-list))
        nil
      (if (string-match-p (car regex-list) string)
  	t
        (check-if-match-regexes string (cdr regex-list)))))

  (defun next-buffer-with-hate ()
    (interactive)
    (let ((cbuffer (buffer-name)))
      (next-buffer)
      (if (and
             (not (equal cbuffer (buffer-name)))
             (check-if-match-regexes (buffer-name) hated-buffers))
           (next-buffer-with-hate))))

  (defun previous-buffer-with-hate ()
    (interactive)
    (let ((cbuffer (buffer-name (current-buffer))))
      (previous-buffer)
      (if (and
             (not (equal cbuffer (buffer-name)))
             (check-if-match-regexes (buffer-name) hated-buffers))
           (previous-buffer-with-hate))))
#+end_src

*** Keybinds Setup

Set leader key, window movement and sane keys to the minibuffer and
ivy.

#+begin_src emacs-lisp
  (evil-set-leader 'normal (kbd "SPC"))
  (define-key minibuffer-local-map (kbd "ESC") 'abort-recursive-edit)
  (define-key minibuffer-local-map (kbd "C-w") 'backward-kill-word)
  (define-key minibuffer-local-map (kbd "C-V") 'clipboard-yank)
  (define-key ivy-minibuffer-map (kbd "C-w") 'backward-kill-word) 
  (define-key ivy-minibuffer-map (kbd "C-j") 'ivy-next-line) 
  (define-key ivy-minibuffer-map (kbd "C-k") 'ivy-previous-line) 
  (define-key ivy-minibuffer-map (kbd "C-h") 'ivy-beginning-of-buffer) 
  (define-key ivy-minibuffer-map (kbd "C-<return>") 'ivy-immediate-done) 
#+end_src

Zooming like a true zoomer (as we do anywhere) and toggling the /Zen Mode/.

#+begin_src emacs-lisp
  (evil-define-key 'normal 'global
    (kbd "C-=") 'text-scale-increase
    (kbd "C--") 'text-scale-decrease
    (kbd "<C-wheel-up>") 'text-scale-increase
    (kbd "<C-wheel-down>") 'text-scale-decrease
    (kbd "C-0") '(lambda () (interactive) (text-scale-adjust 0))
    (kbd "<leader>z") 'darkroom-mode
#+end_src

Running things (compile-mode, man, ripgrep, Emacs commands, shell
commands, Lisp).

#+begin_src emacs-lisp
    (kbd "<leader>b") 'project-compile
    (kbd "<leader>cb") 'compile
    (kbd "<leader>m") 'man
    (kbd "<leader>/") 'rg
    (kbd "SPC SPC") 'counsel-M-x
    (kbd "!") 'shell-command
    (kbd "C-c C-x") 'eval-defun
#+end_src

Inserting things 😳 (key to insert Unicode chars).

#+begin_src emacs-lisp
    (kbd "<leader>x") 'counsel-unicode-char
#+end_src

Navigating anywhere (including important Org files).

#+begin_src emacs-lisp
    (kbd "<leader>p") 'projectile-switch-project
    (kbd "<leader>q") 'projectile-kill-buffers
    (kbd "<leader>f") 'counsel-find-file
    (kbd "<leader>.") 'counsel-projectile-find-file
    (kbd "<leader>a") 'counsel-linux-app
    (kbd "<leader>e") 'deer
    (kbd "TAB") 'next-buffer-with-hate
    (kbd "<backtab>") 'previous-buffer-with-hate
    (kbd "<leader>ot") '(lambda () (interactive)
  			(split-window-below)
  			(windmove-down)
  			(find-file "~/doc/org/todo.org"))
    (kbd "<leader>om") '(lambda () (interactive)
  			(split-window-below)
  			(windmove-down)
  			(find-file "~/doc/org/marker.org"))
    (kbd "<leader>oo") '(lambda () (interactive)
  			(split-window-below)
  			(windmove-down)
  			(find-file "~/doc/org/agenda.org"))
#+end_src

Application keys.

#+begin_src emacs-lisp
    (kbd "<leader>g") 'magit
    (kbd "<leader>RET") 'terminal-here
    (kbd "<leader>oa") 'org-agenda
    (kbd "<leader>ch") '(lambda () (interactive) (terminal-here-launch (list "ghci")))
    (kbd "<leader>cp") '(lambda () (interactive) (terminal-here-launch (list "python")))
    (kbd "<leader>cc") '(lambda () (interactive) (terminal-here-launch (list "julia")))
    (kbd "<leader>cj") '(lambda () (interactive) (terminal-here-launch (list "deno")))
    (kbd "<leader>cl") '(lambda () (interactive) (terminal-here-launch (list "lua")))
    (kbd "<leader>cm") '(lambda () (interactive) (terminal-here-launch (list "ncmpcpp")))
    (kbd "<leader>cs") '(lambda () (interactive) (terminal-here-launch (list "pulsemixer")))
    (kbd "<leader>ct") '(lambda () (interactive) (terminal-here-launch (list "htop"))))
#+end_src

Visual mode keys. Evaluate highlighted Emacs Lisp expressions with ~C-x~.

#+begin_src emacs-lisp
  (evil-define-key 'visual 'global
    (kbd "C-x") 'eval-region)
#+end_src

Keys for the file manager (~deer~ mode from ~ranger~ that's built on top
of ~dired~).

#+begin_src emacs-lisp
  (define-key ranger-mode-map (kbd "w") 'terminal-here)
  (define-key ranger-mode-map (kbd "!") 'shell-command)
  (define-key ranger-mode-map (kbd "f") 'counsel-find-file)
  (define-key ranger-mode-map (kbd "R") 'ranger-refresh)
  (define-key ranger-mode-map (kbd "$") 'dired-do-shell-command)
  (define-key ranger-mode-map (kbd "h") 'ranger-up-directory)
  (define-key ranger-mode-map (kbd "l") 'ranger-find-file)
  (define-key ranger-mode-map (kbd "RET") 'ranger-find-file)
  (define-key ranger-mode-map (kbd "M-RET") 'ranger-open-file-horizontally)
  (define-key ranger-mode-map (kbd "SPC") 'ranger-toggle-mark)
  (define-key ranger-mode-map (kbd "c") 'dired-unmark-all-marks)
  (define-key ranger-mode-map (kbd "<backspace>") 'dired-do-delete)
  (define-key ranger-mode-map (kbd "M") 'dired-create-directory)
  (define-key ranger-mode-map (kbd "r") 'dired-do-rename)
  (define-key ranger-mode-map (kbd "y") 'ranger-copy)
  (define-key ranger-mode-map (kbd "d") 'ranger-cut)
  (define-key ranger-mode-map (kbd "p") 'ranger-paste)
  (define-key ranger-mode-map (kbd "Y") 'ranger-copy-filename)
  (define-key ranger-mode-map (kbd "a") 'ranger-toggle-dotfiles)
#+end_src

Keys for the PDF reader.

#+begin_src emacs-lisp
  (with-eval-after-load 'pdf-view
    (evil-define-key 'normal pdf-view-mode-map
      (kbd "q") 'kill-buffer-and-window
      (kbd "t") 'pdf-view-fit-page-to-window
      (kbd "s") 'pdf-view-fit-width-to-window
      (kbd "j") 'pdf-view-next-line-or-next-page
      (kbd "k") 'pdf-view-previous-line-or-previous-page))
#+end_src

Automatically kill image buffers, compile and calendars on exit with ~q~.

#+begin_src emacs-lisp
  (evil-define-key 'normal image-mode-map
    (kbd "q") 'kill-buffer-and-window)
  (evil-define-key 'normal calendar-mode-map
    (kbd "q") 'kill-buffer-and-window)
  (evil-define-key 'normal compilation-mode-map
    (kbd "q") 'kill-buffer-and-window)
#+end_src
