README.el

(evil-set-leader 'normal (kbd "SPC"))
(define-key minibuffer-local-map (kbd "ESC") 'abort-recursive-edit)
(define-key minibuffer-local-map (kbd "C-w") 'backward-kill-word)
(define-key minibuffer-local-map (kbd "C-V") 'clipboard-yank)
(define-key ivy-minibuffer-map (kbd "C-w") 'backward-kill-word) 
(define-key ivy-minibuffer-map (kbd "C-j") 'ivy-next-line) 
(define-key ivy-minibuffer-map (kbd "C-k") 'ivy-previous-line) 
(define-key ivy-minibuffer-map (kbd "C-h") 'ivy-beginning-of-buffer) 
(define-key ivy-minibuffer-map (kbd "C-<return>") 'ivy-immediate-done)

(evil-define-key 'normal 'global
  (kbd "C-=") 'text-scale-increase
  (kbd "C--") 'text-scale-decrease
  (kbd "<C-wheel-up>") 'text-scale-increase
  (kbd "<C-wheel-down>") 'text-scale-decrease
  (kbd "C-0") '(lambda () (interactive) (text-scale-adjust 0))
  (kbd "<leader>z") 'darkroom-mode

(kbd "<leader>b") 'project-compile
(kbd "<leader>cb") 'compile
(kbd "<leader>m") 'man
(kbd "<leader>/") 'rg
(kbd "SPC SPC") 'counsel-M-x
(kbd "!") 'shell-command
(kbd "C-c C-x") 'eval-defun

(kbd "<leader>x") 'counsel-unicode-char

(kbd "<leader>p") 'projectile-switch-project
(kbd "<leader>q") 'projectile-kill-buffers
(kbd "<leader>f") 'counsel-find-file
(kbd "<leader>.") 'counsel-projectile-find-file
(kbd "<leader>a") 'counsel-linux-app
(kbd "<leader>e") 'deer
(kbd "TAB") 'projectile-next-project-buffer
(kbd "<backtab>") 'projectile-previous-project-buffer
(kbd "<leader>ot") '(lambda () (interactive)
  		    (split-window-below)
  		    (windmove-down)
  		    (find-file "~/doc/org/todo.org"))
(kbd "<leader>om") '(lambda () (interactive)
  		    (split-window-below)
  		    (windmove-down)
  		    (find-file "~/doc/org/marker.org"))
(kbd "<leader>oo") '(lambda () (interactive)
  		    (split-window-below)
  		    (windmove-down)
  		    (find-file "~/doc/org/agenda.org"))

(kbd "<leader>g") 'magit
(kbd "<leader>RET") 'terminal-here
(kbd "<leader>oa") 'org-agenda
(kbd "<leader>ch") '(lambda () (interactive) (terminal-here-launch (list "ghci")))
(kbd "<leader>cp") '(lambda () (interactive) (terminal-here-launch (list "python")))
(kbd "<leader>cc") '(lambda () (interactive) (terminal-here-launch (list "julia")))
(kbd "<leader>cj") '(lambda () (interactive) (terminal-here-launch (list "deno")))
(kbd "<leader>cl") '(lambda () (interactive) (terminal-here-launch (list "lua")))
(kbd "<leader>cm") '(lambda () (interactive) (terminal-here-launch (list "ncmpcpp")))
(kbd "<leader>cs") '(lambda () (interactive) (terminal-here-launch (list "pulsemixer")))
(kbd "<leader>ct") '(lambda () (interactive) (terminal-here-launch (list "htop"))))

(evil-define-key 'visual 'global
  (kbd "C-x") 'eval-region)

(define-key ranger-mode-map (kbd "w") 'terminal-here)
(define-key ranger-mode-map (kbd "!") 'shell-command)
(define-key ranger-mode-map (kbd "f") 'counsel-find-file)
(define-key ranger-mode-map (kbd "R") 'ranger-refresh)
(define-key ranger-mode-map (kbd "$") 'dired-do-shell-command)
(define-key ranger-mode-map (kbd "h") 'ranger-up-directory)
(define-key ranger-mode-map (kbd "l") 'ranger-find-file)
(define-key ranger-mode-map (kbd "RET") 'ranger-find-file)
(define-key ranger-mode-map (kbd "M-RET") 'ranger-open-file-horizontally)
(define-key ranger-mode-map (kbd "SPC") 'ranger-toggle-mark)
(define-key ranger-mode-map (kbd "c") 'dired-unmark-all-marks)
(define-key ranger-mode-map (kbd "<backspace>") 'dired-do-delete)
(define-key ranger-mode-map (kbd "M") 'dired-create-directory)
(define-key ranger-mode-map (kbd "r") 'dired-do-rename)
(define-key ranger-mode-map (kbd "y") 'ranger-copy)
(define-key ranger-mode-map (kbd "d") 'ranger-cut)
(define-key ranger-mode-map (kbd "p") 'ranger-paste)
(define-key ranger-mode-map (kbd "Y") 'ranger-copy-filename)
(define-key ranger-mode-map (kbd "a") 'ranger-toggle-dotfiles)

(with-eval-after-load 'pdf-view
  (evil-define-key 'normal pdf-view-mode-map
    (kbd "q") 'kill-buffer-and-window
    (kbd "t") 'pdf-view-fit-page-to-window
    (kbd "s") 'pdf-view-fit-width-to-window
    (kbd "j") 'pdf-view-next-line-or-next-page
    (kbd "k") 'pdf-view-previous-line-or-previous-page))

(evil-define-key 'normal image-mode-map
  (kbd "q") 'kill-buffer-and-window)
(evil-define-key 'normal calendar-mode-map
  (kbd "q") 'kill-buffer-and-window)
(evil-define-key 'normal compilation-mode-map
  (kbd "q") 'kill-buffer-and-window)
